I'm not sure how your getting the structure you're getting as node_config is a root parameter for google_container_cluster. From the example given on https://registry.terraform.io/providers/hashicorp/google/latest/docs/resources/container_cluster and the current provider 5.10.0: 
Tf plans  - showing that a node_config block is available.
```

  # google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + cluster_ipv4_cidr           = (known after apply)
    ...
      + tpu_ipv4_cidr_block         = (known after apply)

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)

```